// 'use strict';
// import axios from "axios";

// export default function initialize(){
//   axios.defaults.headers.common["Authorization"] = `Bearer `;
// }

// let gendars = ['انثي', 'ذكر'];
let cities = [];
import Vue from "vue";
export const globalStore = {

  genders : {
      0 : 'انثي',
      1 : 'ذكر',
  },
//   genders: [
//     { value: 'انثي', index: '0' },
//     { value: 'ذكر', index: '1' },
//   ],

  valueOrPersentages : {
      0 : 'القيمة',
      1 : 'نسبه',
  },

  offPrints : {
      1 : 'شهادة قيد طالب',
      2 : 'شهادة حسن سير وسلوك',
      3 : 'مخالصة بمصروفات طالب',
  },

  is_mandataries : {
      0 : 'غير إجباري',
      1 : 'إجباري',
  },
  
  religions: {
      1 : 'الاسلام',
      2 : 'المسيحية',
      3 : 'اخري',
  },

  payment_statuses : {
      1 : 'لم يدفع بعد',
      2 : 'جزئي',
      3 : 'كامل',
  },

  identifcation_types : {
      1 : 'جواز سفر',
      2 : 'رقم وطني',
      3 : 'بطاقة قومية',
  },

  blood_types: {
      1 : 'O+',
      2 : 'O-',
      3 : 'A+',
      4 : 'A-',
      5 : 'B+',
      6 : 'B-',
      7 : 'AB+',
      8 : 'AB-',
  },

  
  mr_ds : {
      1 : 'السيد',
      2 : 'السيدة',
      3 : '\د',
      4 : '\أ',
      5 : '\بروف',
   },

  relations : {
      1 : 'أب',
      2 : 'ام',
      3 : 'خال',
      4 : 'عم',
      5 : 'خالة',
      6 : 'عمة',
      7 : 'احرى',
   },

  nationalities : {
      1 : 'السودان',
      2 : 'جنوب السودان',
      3 : 'مصر',
      4 : 'اثيوبيا',
      5 : 'اريتريا',
      6 : 'سوريا',
      7 : 'احرى',
   },

  martials : {
      1 : 'متزوج',
      2 : ' عازب',
      3 : 'مطلق',
      4 : 'ارمل',
   },

  is_dies : {
      0 : 'حي',
      1 : 'ميت',
   },

  agreementTypes : {
      1 : 'استقالة',
      2 : ' استلام مرتبات',
      3 : ' اصدار عقوبات',
      4 : 'التحاق بالعمل',
      5 : ' إذن خروج',
      6 : ' اقرار القيام بالعمل',
  },

  job_titles : {
      1 : 'موظف',
      2 : ' معلم',
      3 : ' عامل',
  },


  safes : {
      1 : 'بنك الخرطوم',
      2 : ' بنك فيصل الاسلامي ',
      3 : 'بنك الخليج',
      4 : ' بنك الثروة الحيوانية',
      5 : ' بنك العمال ',
  },

  RewardsPunitions : {
      0 : 'مكافأة ',
      1 : 'خصم',
  },

  calendTypes : { 
      1 : 'مخالفات متعلقة بنظام العمل ',
      2 : 'مخالفات متعلقة بسلوك العمل',
      3 : 'مخالفات متعلقة بمواعيد العمل',
  },
  attendanceStatuses : {
      1 : 'حاضر',
      2 : 'غائب',
      3 : 'اخرى',
  },

  is_partner_sons : {
      0 : 'لا',
      1 : 'نعم',

  },

  is_staff_sons : {
      0 : 'لا',
      1 : 'نعم',
  },

  certificateDegrees : {
      1 : 'إمتياز',
      2 : 'جيد جدا',
      3 : 'جيد',
      4 : 'مقبول',
      5 : 'ضعيف',
  },

  certificateTypes : {

      1 : 'دبلوم',
      2 : 'بكلاريوس ',
      3 : 'دبلوم عالي',
      4 : 'ماجستير',
      5 : 'دكتوراة',
      5 : 'الاستاذية',
      5 : 'اخرى',
  },

  experience_years : {
       1 : '1',
       2 : '2 ',
       3 : '3',
       4 : '4',
       5 : '5',
       5 : '6',
       5 : 'اخرى',
   },

   study_status: {
        1 : 'مرفع',
        2 : 'جديد',
        3 : 'عائد',
    },

    education_years: {
        '2013/2014' : '2013/2014',
        '2014/2015' : '2014/2015',
        '2015/2016' : '2015/2016',
        '2016/2017' : '2016/2017',
        '2017/2018' : '2017/2018',
        '2018/2019' : '2018/2019',
        '2019/2020' : '2019/2020',
        '2020/2021' : '2020/2021',
        '2021/2022' : '2021/2022',
        '2022/2023' : '2022/2023',
        '2023/2024' : '2023/2024',
        '2024/2025' : '2024/2025',
    },


  

//   cities: { 
//     1 : 'الخرطوم',
//     2 : 'خرطوم بحري',
//     3 : 'أم درمان',
//     4 : 'بورتسودان',
//     5 : 'نيالا',
//     6 : 'الأبيض',
//     7 : 'كسلا',
//     8 : 'كوستي',
//     9 : 'ود مدنى',
//     10 : 'الفاشر',
//     11 : 'القضارف',
//     12 : 'عطبرة',
//     13 : 'الدامر',
//     14 : 'سنار',
//     15 : 'دنقلا',
//     16 : 'سواكن',
//     17 : 'وادي حلفا',
//     18 : 'حلفا الجديدة',
//     19 : 'أم روابة',
//     20 : 'شندي',
//     21 : 'ربك',
//     22 : 'الجنينة',
//     23 : 'كادقلى',
//     24 : 'الدويم',
//     25 : 'سنجة',
//     26 : 'الضعين',
//     27 : 'الدمازين',
//   },


cities: { 
    1 : 'ولاية الخرطوم',
    2 : 'ولاية البحر الأحمر',
    3 : 'الولاية الشمالية',
    4 : 'ولاية نهر النيل',
    5 : 'ولاية النيل الأبيض',
    6 : 'ولاية الجزيرة ',
    7 : 'ولاية شمال كردفان',
    8 : 'ولاية جنوب كردفان',
    9 : 'ولاية شمال دارفور',
    10 : 'ولاية غرب دارفور',
    11 : 'ولاية جنوب دارفور',
    12 : 'ولاية سنار',
    13 : 'ولاية كسلا ',
    14 : 'ولاية القضارف ',
    15 : 'ولاية النيل الأزرق',
  },
  
  locals: {
      1 : {1 : 'الخرطوم', 2 : 'الخرطوم بحري', 3 : ' أمدرمان', 4 : 'شرق النيل', 5 : ' جبل أولياء', 6 : ' أم بدة', 6 : 'كرري'},
      2 : {1 : 'بورتسودان', 2 : 'حلايب', 3 : 'سنكات', 4 : 'طوكر', 5 : 'سواكن', 6 : 'عقيق', 7 : 'القنب والاوليب', 8 : 'هيا'},
      3 : {1 : 'الدبة', 2 : 'دنقلا- مروي', 3 : 'وادي حلفا', 4 : 'دلقو', 5 : 'البرقيق', 6 : 'القولد'},
      4 : {1 : 'أبو حمد', 2 : 'الدامر- المتمة', 2 : 'بربر- شندي -عطبرة'},
      5 : {1 : 'الجبلين', 2 : 'الدويم', 3 : 'القطينة', 4 : 'كوستي', 5 : 'السلام', 6 : 'تندلتى', 7 : 'ام رمته', 8 : 'ربك'},
      6 : {1 : 'الحصاحيصا', 2 : 'الكاملين', 3 : 'المناقل', 4 : 'أم القرى', 5 : 'جنوب الجزيرة', 6 : 'شرق الجزيرة', 6 : 'ود مدني الكبرى'},
      7 : {1 : 'أم روابة', 2 : 'بارا- جبرة الشيخ', 3 : 'سودري', 4 : 'شيكان', 5 : 'النهود', 6 : 'غبيش', 7 : 'ابوزبد', 8 : 'ودبندة'},
      8 : {1 : 'أبو جبيهة', 2 : 'الدلنج', 3 : 'الرشاد', 4 : 'تلودي', 5 : 'كادوقلي', 6 : 'السلام', 7 : 'ابيي', 8 : 'لقاوة', 9 : 'كليك', 10 : 'ابو جبيهه'},
      9 : {1 : 'الفاشر', 2 : 'أم كدادة', 3 : 'كبكابية', 4 : 'كتم', 5 : 'مليط', 6 : 'الواحة', 7 : 'الطينة', 8 : 'الطويشة اللعيت', 9 : 'دار السلام', 10 : 'كلمندو', 11 : 'الكومة', 12 : 'سرف عمرة', 2 : 'السريف', 2 : 'المالحة'},
      10 : {1 : 'الجنينة', 2 : 'جبل مرة', 3 : 'زالنجي', 4 : 'كليس', 5 : 'مكجر -هبيلا -وادي صالح', 6 : 'ركورو', 7 : 'ازوم', 8 : 'الجنينة', 9 : 'بيضة', 10 : 'سربا', 11 : 'نيرتيا', 2 : 'كرينك', 12 : 'ام دخن'},
      11 : {1 : 'الضعين', 2 : 'برام', 3 : 'تلس', 4 : 'رهيد البردي', 5 : 'شعيرية', 6 : 'عد الفرسان- عديلة', 7 : 'كاس', 8 : 'نيالا'},
      12 : {1 : 'الدندر- سنار', 2 : 'شرق سنار', 3 : 'سنجة', 4 : 'السوكي'},
      13 : {1 : 'القاش', 2 : 'ستيت', 3 : 'كسلا', 4 : 'نهر عطبرة -همشكوريب'},
      14 : {1 : 'الرهد', 2 : 'الفاو', 3 : 'الفشقة', 4 : 'القضارف', 5 : 'القلابات الغربية', 6 : 'القلابات الشرقية', 7 : 'البطانة'},
      15 : {1 : 'الدمازين', 2 : 'الروصيرص', 3 : 'الكرمك', 4 : 'باو', 5 : 'قيسان',}
  },

}